In [1]:
import pandas as pd


url = "df_limpio.csv"
df = pd.read_csv(url)

In [2]:
df = df[df["sex"] != "Total"]
df["sex"].unique()

array(['Females', 'Males'], dtype=object)

In [3]:
df

,sex,age,level_education,country,year,value_unemployment,value_education,valor_educacion,indice_educativo
0,Females,15-29,ESO,Austria,2014,15.7,27.9,1,2.84
1,Females,15-29,ESO,Austria,2015,15.3,27.5,1,2.89
2,Females,15-29,ESO,Austria,2016,17.1,27.3,1,2.91
3,Females,15-29,ESO,Austria,2017,16.8,27.2,1,2.92
4,Females,15-29,ESO,Austria,2018,13.4,27.1,1,2.92
...,...,...,...,...,...,...,...,...,...
4636,Males,15-29,UNIVERSIDAD,United Kingdom,2015,6.2,26.6,5,3.14
4637,Males,15-29,UNIVERSIDAD,United Kingdom,2016,5.3,27.1,5,3.14
4638,Males,15-29,UNIVERSIDAD,United Kingdom,2017,4.6,27.1,5,3.14
4639,Males,15-29,UNIVERSIDAD,United Kingdom,2018,5.0,28.1,5,3.17
4640,Males,15-29,UNIVERSIDAD,United Kingdom,2019,5.9,28.7,5,3.17

In [4]:
df_country = df["country"]

In [5]:
df_country

0              Austria
1              Austria
2              Austria
3              Austria
4              Austria
             ...
4636    United Kingdom
4637    United Kingdom
4638    United Kingdom
4639    United Kingdom
4640    United Kingdom
Name: country, Length: 3114, dtype: object

In [6]:
country1 = {
            'id_country': ["AT", "BE", "BG", "CH", "CY", "CZ", "DE", "DK", "EE", "EL", "ES", "FI", "FR", 
               "HR", "HU", "IE", "IS", "IT", "LT", "LV","MK", "NL", "NO", "PL", "PT", "RO", "RS", "SE", "SI", "SK", "TR", "UK"],  # Valores para id_country
         }

# Crear el DataFrame
country = pd.DataFrame(country1)
country

   id_country
0          AT
1          BE
2          BG
3          CH
4          CY
5          CZ
6          DE
7          DK
8          EE
9          EL
10         ES
11         FI
12         FR
13         HR
14         HU
15         IE
16         IS
17         IT
18         LT
19         LV
20         MK
21         NL
22         NO
23         PL
24         PT
25         RO
26         RS
27         SE
28         SI
29         SK
30         TR
31         UK

In [7]:
country["country_name"]= df["country"].unique()
country

   id_country     country_name
0          AT          Austria
1          BE          Belgium
2          BG         Bulgaria
3          CH          Croatia
4          CY           Cyprus
5          CZ          Czechia
6          DE          Denmark
7          DK          Estonia
8          EE          Finland
9          EL           France
10         ES          Germany
11         FI           Greece
12         FR          Hungary
13         HR          Iceland
14         HU          Ireland
15         IE            Italy
16         IS           Latvia
17         IT        Lithuania
18         LT      Netherlands
19         LV  North Macedonia
20         MK           Norway
21         NL           Poland
22         NO         Portugal
23         PL          Romania
24         PT           Serbia
25         RO         Slovakia
26         RS         Slovenia
27         SE            Spain
28         SI           Sweden
29         SK      Switzerland
30         TR          TÃ¼rkiye
31         UK   United Kingdom

In [8]:
gender1 = {'id_gender': ["F", "M"]}
gender = pd.DataFrame(gender1)
gender["gender"] = df["sex"].unique()
gender

  id_gender   gender
0         F  Females
1         M    Males

In [9]:
df["level_education"].unique()

array(['ESO', 'BACH-FP', 'BACH', 'FP', 'UNIVERSIDAD'], dtype=object)

In [10]:
level = {'id_level': ['ESO', 'BACH-FP', 'BACH', 'FP', 'UNIVERSIDAD']}
level_education = pd.DataFrame(level)
level_education["valor_educacion"] = df["valor_educacion"].unique()
level_education

      id_level  valor_educacion
0          ESO                1
1      BACH-FP                3
2         BACH                4
3           FP                2
4  UNIVERSIDAD                5

In [11]:
df

,sex,age,level_education,country,year,value_unemployment,value_education,valor_educacion,indice_educativo
0,Females,15-29,ESO,Austria,2014,15.7,27.9,1,2.84
1,Females,15-29,ESO,Austria,2015,15.3,27.5,1,2.89
2,Females,15-29,ESO,Austria,2016,17.1,27.3,1,2.91
3,Females,15-29,ESO,Austria,2017,16.8,27.2,1,2.92
4,Females,15-29,ESO,Austria,2018,13.4,27.1,1,2.92
...,...,...,...,...,...,...,...,...,...
4636,Males,15-29,UNIVERSIDAD,United Kingdom,2015,6.2,26.6,5,3.14
4637,Males,15-29,UNIVERSIDAD,United Kingdom,2016,5.3,27.1,5,3.14
4638,Males,15-29,UNIVERSIDAD,United Kingdom,2017,4.6,27.1,5,3.14
4639,Males,15-29,UNIVERSIDAD,United Kingdom,2018,5.0,28.1,5,3.17
4640,Males,15-29,UNIVERSIDAD,United Kingdom,2019,5.9,28.7,5,3.17

In [12]:
def convert_gender(gender):
    if gender == 'Females':
        return 'F'
    elif gender == 'Males':
        return 'M'
    else:
        return 'Unknown'  # En caso de que haya otros valores

# Aplicar la funciÃ³n a la columna
df['id_gender'] = df['sex'].apply(convert_gender)

df

,sex,age,level_education,country,year,value_unemployment,value_education,valor_educacion,indice_educativo,id_gender
0,Females,15-29,ESO,Austria,2014,15.7,27.9,1,2.84,F
1,Females,15-29,ESO,Austria,2015,15.3,27.5,1,2.89,F
2,Females,15-29,ESO,Austria,2016,17.1,27.3,1,2.91,F
3,Females,15-29,ESO,Austria,2017,16.8,27.2,1,2.92,F
4,Females,15-29,ESO,Austria,2018,13.4,27.1,1,2.92,F
...,...,...,...,...,...,...,...,...,...,...
4636,Males,15-29,UNIVERSIDAD,United Kingdom,2015,6.2,26.6,5,3.14,M
4637,Males,15-29,UNIVERSIDAD,United Kingdom,2016,5.3,27.1,5,3.14,M
4638,Males,15-29,UNIVERSIDAD,United Kingdom,2017,4.6,27.1,5,3.14,M
4639,Males,15-29,UNIVERSIDAD,United Kingdom,2018,5.0,28.1,5,3.17,M
4640,Males,15-29,UNIVERSIDAD,United Kingdom,2019,5.9,28.7,5,3.17,M

In [13]:
country_map = {
    'Austria': 'AT', 'Belgium': 'BE', 'Bulgaria': 'BG', 'Switzerland': 'CH', 
    'Cyprus': 'CY', 'Czechia': 'CZ', 'Germany': 'DE', 'Denmark': 'DK', 
    'Estonia': 'EE', 'Greece': 'EL', 'Spain': 'ES', 'Finland': 'FI', 
    'France': 'FR', 'Croatia': 'HR', 'Hungary': 'HU', 'Ireland': 'IE', 
    'Iceland': 'IS', 'Italy': 'IT', 'Lithuania': 'LT', 'Latvia': 'LV', 
    'North Macedonia': 'MK', 'Netherlands': 'NL', 'Norway': 'NO', 
    'Poland': 'PL', 'Portugal': 'PT', 'Romania': 'RO', 'Serbia': 'RS', 
    'Sweden': 'SE', 'Slovenia': 'SI', 'Slovakia': 'SK', 'TÃ¼rkiye': 'TR', 
    'United Kingdom': 'UK'
}

df['id_country'] = df['country'].map(country_map)
df

,sex,age,level_education,country,year,value_unemployment,value_education,valor_educacion,indice_educativo,id_gender,id_country
0,Females,15-29,ESO,Austria,2014,15.7,27.9,1,2.84,F,AT
1,Females,15-29,ESO,Austria,2015,15.3,27.5,1,2.89,F,AT
2,Females,15-29,ESO,Austria,2016,17.1,27.3,1,2.91,F,AT
3,Females,15-29,ESO,Austria,2017,16.8,27.2,1,2.92,F,AT
4,Females,15-29,ESO,Austria,2018,13.4,27.1,1,2.92,F,AT
...,...,...,...,...,...,...,...,...,...,...,...
4636,Males,15-29,UNIVERSIDAD,United Kingdom,2015,6.2,26.6,5,3.14,M,UK
4637,Males,15-29,UNIVERSIDAD,United Kingdom,2016,5.3,27.1,5,3.14,M,UK
4638,Males,15-29,UNIVERSIDAD,United Kingdom,2017,4.6,27.1,5,3.14,M,UK
4639,Males,15-29,UNIVERSIDAD,United Kingdom,2018,5.0,28.1,5,3.17,M,UK
4640,Males,15-29,UNIVERSIDAD,United Kingdom,2019,5.9,28.7,5,3.17,M,UK

In [14]:
df.rename(columns = {"level_education": "id_level"}, inplace = True)
df['id_datos'] = range(1, len(df) + 1)
df

,sex,age,id_level,country,year,value_unemployment,value_education,valor_educacion,indice_educativo,id_gender,id_country,id_datos
0,Females,15-29,ESO,Austria,2014,15.7,27.9,1,2.84,F,AT,1
1,Females,15-29,ESO,Austria,2015,15.3,27.5,1,2.89,F,AT,2
2,Females,15-29,ESO,Austria,2016,17.1,27.3,1,2.91,F,AT,3
3,Females,15-29,ESO,Austria,2017,16.8,27.2,1,2.92,F,AT,4
4,Females,15-29,ESO,Austria,2018,13.4,27.1,1,2.92,F,AT,5
...,...,...,...,...,...,...,...,...,...,...,...,...
4636,Males,15-29,UNIVERSIDAD,United Kingdom,2015,6.2,26.6,5,3.14,M,UK,3110
4637,Males,15-29,UNIVERSIDAD,United Kingdom,2016,5.3,27.1,5,3.14,M,UK,3111
4638,Males,15-29,UNIVERSIDAD,United Kingdom,2017,4.6,27.1,5,3.14,M,UK,3112
4639,Males,15-29,UNIVERSIDAD,United Kingdom,2018,5.0,28.1,5,3.17,M,UK,3113
4640,Males,15-29,UNIVERSIDAD,United Kingdom,2019,5.9,28.7,5,3.17,M,UK,3114

In [15]:
datos_edu = df[["id_datos", "indice_educativo", "value_unemployment", "value_education", "year", "id_country", "id_gender", "id_level"]]

datos_edu

,id_datos,indice_educativo,value_unemployment,value_education,year,id_country,id_gender,id_level
0,1,2.84,15.7,27.9,2014,AT,F,ESO
1,2,2.89,15.3,27.5,2015,AT,F,ESO
2,3,2.91,17.1,27.3,2016,AT,F,ESO
3,4,2.92,16.8,27.2,2017,AT,F,ESO
4,5,2.92,13.4,27.1,2018,AT,F,ESO
...,...,...,...,...,...,...,...,...
4636,3110,3.14,6.2,26.6,2015,UK,M,UNIVERSIDAD
4637,3111,3.14,5.3,27.1,2016,UK,M,UNIVERSIDAD
4638,3112,3.14,4.6,27.1,2017,UK,M,UNIVERSIDAD
4639,3113,3.17,5.0,28.1,2018,UK,M,UNIVERSIDAD
4640,3114,3.17,5.9,28.7,2019,UK,M,UNIVERSIDAD

In [16]:
datos_edu.sample(20)

,id_datos,indice_educativo,value_unemployment,value_education,year,id_country,id_gender,id_level
3428,2302,2.55,7.3,11.0,2021,RO,F,UNIVERSIDAD
49,50,2.94,5.6,30.1,2023,AT,F,UNIVERSIDAD
3704,2478,2.76,22.2,12.5,2017,SK,F,BACH
2187,1492,3.13,6.5,25.1,2023,IE,M,UNIVERSIDAD
4588,3062,3.27,10.5,52.7,2015,UK,F,BACH-FP
2250,1505,2.67,30.3,46.7,2016,IT,F,BACH-FP
306,207,2.88,23.5,38.1,2020,BG,F,ESO
1592,1093,2.55,3.7,12.0,2016,DE,M,UNIVERSIDAD
4013,2687,2.98,33.5,9.3,2016,ES,F,FP
4158,2782,2.94,12.4,25.3,2021,SE,F,BACH
1695,1146,3.07,27.7,22.0,2019,EL,F,UNIVERSIDAD
348,249,2.93,4.7,17.4,2022,BG,F,UNIVERSIDAD
1673,1124,3.07,38.3,36.4,2017,EL,F,BACH
4527,3051,2.50,20.0,18.4,2020,TR,M,UNIVERSIDAD
209,160,2.79,23.3,34.5,2023,BE,M,ESO
1118,769,2.65,10.6,45.5,2022,EE,M,BACH-FP
3894,2618,2.60,7.7,55.1,2017,SI,M,BACH-FP
246,197,2.75,7.2,22.5,2020,BE,M,UNIVERSIDAD
167,118,3.10,13.4,37.4,2021,BE,F,BACH-FP
2391,1596,3.08,17.6,30.4,2017,LV,F,ESO

In [17]:

from sqlalchemy import create_engine, text

In [18]:
import pymysql

In [19]:
# Tus parÃ¡metros de conexiÃ³n
bd = "project_ue"
password = "cambia_contraseÃ±a"  # AsegÃºrate de reemplazar esto con tu contraseÃ±a real
connection_string = 'mysql+pymysql://root:' + password + '@localhost/' + bd
engine = create_engine(connection_string)

# Enviar DataFrame a MySQL
table_name = 'country'
country.to_sql(table_name, con=engine, if_exists='append', index=False)

32

In [20]:
bd = "project_ue"
password = "cambia_contraseÃ±a"  # AsegÃºrate de reemplazar esto con tu contraseÃ±a real
connection_string = 'mysql+pymysql://root:' + password + '@localhost/' + bd
engine = create_engine(connection_string)

# Enviar DataFrame a MySQL
table_name = 'gender'
gender.to_sql(table_name, con=engine, if_exists='append', index=False)

2

In [21]:
bd = "project_ue"
password = "cambia_contraseÃ±a"  # AsegÃºrate de reemplazar esto con tu contraseÃ±a real
connection_string = 'mysql+pymysql://root:' + password + '@localhost/' + bd
engine = create_engine(connection_string)

# Enviar DataFrame a MySQL
table_name = 'datos_educativos'
datos_edu.to_sql(table_name, con=engine, if_exists='append', index=False)

3114

In [22]:
bd = "project_ue"
password = "cambia_contraseÃ±a"  # AsegÃºrate de reemplazar esto con tu contraseÃ±a real
connection_string = 'mysql+pymysql://root:' + password + '@localhost/' + bd
engine = create_engine(connection_string)

# Enviar DataFrame a MySQL
table_name = 'level_education'
level_education.to_sql(table_name, con=engine, if_exists='append', index=False)

5